app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT  "posts".* FROM "posts" WHERE "posts"."category_id" = ? LIMIT ?  [["category_id", 1], ["LIMIT", 1]]
---
  def index
    @posts = Post.all
    @posts_love = @posts.where(category_id: 1)

SELECT "categories".* FROM "categories"
---
  def new
    @post = Post.new
    @categories = Category.all

INSERT INTO "posts" ("category_id", "title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category_id", 1], ["title", "i"], ["content", "love u"], ["user_id", 1], ["created_at", 2017-05-02 08:48:25 UTC], ["updated_at", 2017-05-02 08:48:25 UTC]]
---
  def create
    post = Post.new(post_params)
    post.user_id = current_user.id
    post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "오늘은sd"], ["content", "s무엇을할까요dsfsdfdsdsd"], ["updated_at", 2017-04-09 09:39:05 UTC], ["id", 2]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.delete